/*ЗАПУСКАЕМ
░ГУСЯ░▄▀▀▀▄░РАБОТЯГИ░░ 
▄███▀░◐░░░▌░░░░░░░ 
░░░░▌░░░░░▐░░░░░░░ 
░░░░▐░░░░░▐░░░░░░░ 
░░░░▌░░░░░▐▄▄░░░░░ 
░░░░▌░░░░▄▀▒▒▀▀▀▀▄
░░░▐░░░░▐▒▒▒▒▒▒▒▒▀▀▄
░░░▐░░░░▐▄▒▒▒▒▒▒▒▒▒▒▀▄
░░░░▀▄░░░░▀▄▒▒▒▒▒▒▒▒▒▒▀▄
░░░░░░▀▄▄▄▄▄█▄▄▄▄▄▄▄▄▄▄▄▀▄
░░░░░░░░░░░▌▌░▌▌░░░░░ 
░░░░░░░░░░░▌▌░▌▌░░░░░ 
░░░░░░░░░▄▄▌▌▄▌▌░░░░░*/
#include <iostream>

int main() {
    int group, group_, n, n_, N, N_, check, ans, type;
    std::cout << "Введите номер группы\n";
    std::cin >> group;
    if (group > 172 && group < 179) {
        group = group % 10;
    }
    std::cout << "Введите номер Вашего варианта\n";
    std::cin >> N;
    for (int i = 1; i != 22; ++i) {
        n = N + (i - 1) * (group - 2);
        n %= 30;
        if (n == 0) {
            n = 30;
        }
        std::cout << "В " << i << "-ом задании номер задачи " << n << '\n';
    }
    std::cout << "Выбирайте режим работы - смотрим совпадения по заданию или по варианту. Для варианта введите 0, иначе 1\n";
    std::cin >> type;
    if (type) {
        std::cout << "Введите номер задания\n";
        while (std::cin >> check) {
            for (int i = 3; i != 9; ++i) {
                if (i != group) {
                    ans = N + (check - 1) * (group - i);
                    if (ans <= 0) {
                        while (ans <= 0) {
                            ans += 30;
                        }
                    }
                    if (ans > 30) {
                        ans = ans % 30;
                    }
                    std::cout << "В группе 17" << i << " человек с вариантом " << ans << '\n';
                }
            }
            std::cout << "Введите номер задания\n";
        }
    } else {
        std::cout << "Введите номер группы\n";
        while (std::cin >> group_) {
            if (group_ > 172 && group_ < 179) {
                group_ = group_ % 10;
            }
            std::cout << "Введите номер варианта\n";
            std::cin >> N_;
            for (int i = 1; i != 22; ++i) {
                n = N + (i - 1) * (group - 2);
                n_ = N_ + (i - 1) * (group_ - 2);
                n %= 30;
                if (n == 0) {
                    n = 30;
                }
                n_ %= 30;
                if (n_ == 0) {
                    n_ = 30;
                }
                if (n == n_) {
                    std::cout << "В " << i << "-ом задании номер задачи " << n << '\n';
                }
            }
            std::cout << "Введите номер группы\n";
        }
    }
}
